# Стилистическое преобразование чисел:

#print(20,"December", 1988, sep="/")
# Напишите программу, которая запрашивает у пользователя последовательно день его рождения, месяц и год

print("Date")
print(input())
print("Month")
print(input())
print("Year")
print(input())
